; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_3 ?v7 - type_2 ?v1 - type_3)
 	      (pred_1 ?v3 - object ?v1 - type_3)
	      (pred_2 ?v7 - type_2 ?v8 - type_1)
	      (pred_4 ?v7 - type_2 ?v3 - object ?v8 - type_1))

   (:action op_3
       :parameters  (?v7 - type_2 ?v2 ?v6 - type_3)
       :precondition (and  (pred_3 ?v7 ?v2))
       :effect (and  (pred_3 ?v7 ?v6)
		     (not (pred_3 ?v7 ?v2))))

   (:action op_1
       :parameters (?v7 - type_2 ?v5 - object ?v4 - type_3 ?v8 - type_1)
       :precondition  (and  (pred_1 ?v5 ?v4) (pred_3 ?v7 ?v4) (pred_2 ?v7 ?v8))
       :effect (and (pred_4 ?v7 ?v5 ?v8)
		    (not (pred_1 ?v5 ?v4)) 
		    (not (pred_2 ?v7 ?v8))))

   (:action op_2
       :parameters (?v7 - type_2 ?v5 - object ?v4 - type_3 ?v8 - type_1)
       :precondition  (and  (pred_4 ?v7 ?v5 ?v8) (pred_3 ?v7 ?v4))
       :effect (and (pred_1 ?v5 ?v4)
		    (pred_2 ?v7 ?v8)
		    (not (pred_4 ?v7 ?v5 ?v8)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_01 - type_2
obj_09 obj_06 - type_1
obj_03 obj_08 obj_07 obj_04 - type_3
obj_10 obj_02 obj_05 - object)
(:init
(pred_3 obj_01 obj_04)
(pred_2 obj_01 obj_09)
(pred_2 obj_01 obj_06)
(pred_1 obj_10 obj_07)
(pred_1 obj_02 obj_08)
(pred_1 obj_05 obj_04)
)
(:goal
(and
(pred_1 obj_10 obj_08)
(pred_1 obj_02 obj_03)
(pred_1 obj_05 obj_03)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_4 obj_01 ?b obj_06))))
)
)

; plan
1. (op_1 obj_01 obj_05 obj_04 obj_09)
   deleted: (pred_1 obj_05 obj_04) (pred_2 obj_01 obj_09)
   added: (pred_4 obj_01 obj_05 obj_09)
   goals met: 0 of 3
2. (op_3 obj_01 obj_04 obj_03)
   deleted: (pred_3 obj_01 obj_04)
   added: (pred_3 obj_01 obj_03)
   goals met: 0 of 3
3. (op_2 obj_01 obj_05 obj_03 obj_09)
   deleted: (pred_4 obj_01 obj_05 obj_09)
   added: (pred_1 obj_05 obj_03) (pred_2 obj_01 obj_09)
   goals met: 1 of 3
4. (op_3 obj_01 obj_03 obj_07)
   deleted: (pred_3 obj_01 obj_03)
   added: (pred_3 obj_01 obj_07)
   goals met: 1 of 3
5. (op_1 obj_01 obj_10 obj_07 obj_09)
   deleted: (pred_1 obj_10 obj_07) (pred_2 obj_01 obj_09)
   added: (pred_4 obj_01 obj_10 obj_09)
   goals met: 1 of 3
6. (op_3 obj_01 obj_07 obj_08)
   deleted: (pred_3 obj_01 obj_07)
   added: (pred_3 obj_01 obj_08)
   goals met: 1 of 3
7. (op_2 obj_01 obj_10 obj_08 obj_09)
   deleted: (pred_4 obj_01 obj_10 obj_09)
   added: (pred_1 obj_10 obj_08) (pred_2 obj_01 obj_09)
   goals met: 2 of 3
8. (op_1 obj_01 obj_02 obj_08 obj_09)
   deleted: (pred_1 obj_02 obj_08) (pred_2 obj_01 obj_09)
   added: (pred_4 obj_01 obj_02 obj_09)
   goals met: 2 of 3
9. (op_3 obj_01 obj_08 obj_03)
   deleted: (pred_3 obj_01 obj_08)
   added: (pred_3 obj_01 obj_03)
   goals met: 2 of 3
10. (op_2 obj_01 obj_02 obj_03 obj_09)
   deleted: (pred_4 obj_01 obj_02 obj_09)
   added: (pred_1 obj_02 obj_03) (pred_2 obj_01 obj_09)
   goals met: 3 of 3
